''' Task 5. 10
Вернуть из dictionary все уникальные values.

Пример
Входные данные = [{"V":"S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII":"S005"}, {"V":"S009"},{"VIII":"S007"}]
Результат = {'S001', 'S005', 'S007', 'S002', 'S009'}'''


l_1 = [{"V":"S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII":"S005"}, {"V":"S009"},{"VIII":"S007"}] # заданный список словарей
l_2 = []
# l_2 = [l_1[a].values() for a in range(len(l_1))] #  неудачная попытка создать список через list comprehensions ))

for a in range(len(l_1)): # создаем список из значений всех словарей исходного списка
    l_2.extend(l_1[a].values())
l_set = set(l_2) # преобразуем список в множество, оставляем уникальные значения
print(l_2)

