'''Task 5. 10
Вернуть из dictionary все уникальные values.
Пример
Входные данные = [{"V":"S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII":"S005"}, {"V":"S009"},{"VIII":"S007"}]
Усложнение! +5 points
Вернуть ту же структуру.
После dictionary L = [{"V":"S001"}, {"V": "S002"}, {"VI": "S005"}, {"V":"S009"},{"VIII":"S007"}]'''


l_1 = [{"V":"S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII":"S005"}, {"V":"S009"},{"VIII":"S007"}] # заданный список словарей
# перекрестная проверка взаимных элементов на совпадение
for a in range(len(l_1)):
    for b in range(len(l_1)):
        if a == b: continue
        if str(l_1[a].values()) == str(l_1[b].values()): # при совпадении элемента присваиваем ему "пустое" значение
            l_1[b] = {}
while {} in l_1:
    l_1.remove({}) # удаляем все пустые словари из исходного списка
print(l_1)
